[AdventLancerArmor X2ArmorTemplate]
FriendlyName="变种人强袭枪兵护甲"
FriendlyNamePlural="变种人强袭枪兵护甲"
BriefSummary="变种人强袭枪兵穿的护甲和变种人军官一样。我们没有发现明显的升级，因为两种防护服提供了相同的防护水平。然而，变种人强袭枪兵的版本确实提供了额外的机动性，以消除额外的实用存储为代价。这与他们将近战攻击作为主要目标的战术使用是一致的。在我们的版本中，我们成功地保留了原始套装的相同属性。"
TacticalText="<Bullet/>士兵们可以在战斗中使用回收的变种人强袭枪兵装备。此外，我们还可以用这种新护甲让敌人猝不及防。"


[AdventLancerArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="欺骗"
LocLongDescription="变种人在初次接敌中将不太可能发现这个士兵。"
LocHelpText="变种人在初次接敌中将不太可能发现这个士兵。"
LocFlyOverText="变种人在初次接敌中将不太可能发现这个士兵。"
LocPromotionPopupText="<Bullet/> 变种人在初次接敌中将不太可能发现这个士兵。"


[AdventLancerArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="复合材料"
LocLongDescription="变种人强袭枪兵护甲提供了额外的机动性。"
LocHelpText="变种人强袭枪兵护甲提供了额外的机动性。"
LocFlyOverText="变种人强袭枪兵护甲提供了额外的机动性。"
LocPromotionPopupText="<Bullet/> 变种人强袭枪兵护甲提供了额外的机动性。"
